#include "all.h"

int     player_state;

//--------------------------------------
//  プレイヤーの初期設定
//--------------------------------------
void player_init()
{
	player_state = 0;
}

//--------------------------------------
//  プレイヤーの終了処理
//--------------------------------------
void player_deinit()
{

}
//

//  プレイヤーの更新処理
//--------------------------------------
void player_update()
{
	switch (player_state)
	{
	case 0:
		//////// 初期設定 ////////


		++player_state;
		/*fallthrough*/

	case 1:
		//////// パラメータの設定 ////////

		++player_state;
		/*fallthrough*/

	case 2:
		//////// 通常時 ////////

		// 行動の遷移
		player_act();


		break;
	}
}

//--------------------------------------
//  プレイヤーの描画
//--------------------------------------
void player_render()
{


}

//--------------------------------------
//  プレイヤーの行動の遷移
//--------------------------------------
void player_act()
{


}

